In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline 

file1= 'df_final_demo.txt'
file2='df_final_experiment_clients.txt'
file3='df_final_web_data_pt_1.txt'
file4='df_final_web_data_pt_2.txt'
df1 = pd.read_csv(file4)
df2 = pd.read_csv(file3)
df3 = pd.read_csv(file2)
df4 = pd.read_csv(file1)

In [ ]:
df1 = pd.read_csv(file3)

In [ ]:
df2 = pd.read_csv(file4)

In [ ]:
df3 = pd.read_csv(file2)

In [ ]:
df4 = pd.read_csv(file1)

In [3]:
# merging the dataframes from the df_final_web_data_pt_1.txt' and df_final_web_data_pt_2.txt'
dfs = pd.concat([df1,df2], ignore_index=True)
dfs

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58
...,...,...,...,...,...
755400,2443347,465784886_73090545671,136329900_10529659391_316129,confirm,2017-03-31 15:15:46
755401,2443347,465784886_73090545671,136329900_10529659391_316129,step_3,2017-03-31 15:14:53
755402,2443347,465784886_73090545671,136329900_10529659391_316129,step_2,2017-03-31 15:12:08
755403,2443347,465784886_73090545671,136329900_10529659391_316129,step_1,2017-03-31 15:11:37
755404,2443347,465784886_73090545671,136329900_10529659391_316129,start,2017-03-31 15:10:47

In [4]:
dfs.isnull()

        client_id  visitor_id  visit_id  process_step  date_time
0           False       False     False         False      False
1           False       False     False         False      False
2           False       False     False         False      False
3           False       False     False         False      False
4           False       False     False         False      False
...           ...         ...       ...           ...        ...
755400      False       False     False         False      False
755401      False       False     False         False      False
755402      False       False     False         False      False
755403      False       False     False         False      False
755404      False       False     False         False      False

[755405 rows x 5 columns]

In [5]:
dfs.dtypes

client_id        int64
visitor_id      object
visit_id        object
process_step    object
date_time       object
dtype: object

In [6]:
# convert the date
dfs['date_time'] = pd.to_datetime(dfs['date_time'])
dfs['date_time']

0        2017-06-06 08:56:00
1        2017-06-01 11:59:27
2        2017-06-01 11:58:48
3        2017-06-01 11:58:08
4        2017-06-01 11:57:58
                 ...
755400   2017-03-31 15:15:46
755401   2017-03-31 15:14:53
755402   2017-03-31 15:12:08
755403   2017-03-31 15:11:37
755404   2017-03-31 15:10:47
Name: date_time, Length: 755405, dtype: datetime64[ns]

In [9]:
df3.columns

Index(['client_id', 'Variation'], dtype='object')

In [10]:
df4.columns

Index(['client_id', 'clnt_tenure_yr', 'clnt_tenure_mnth', 'clnt_age', 'gendr',
       'num_accts', 'bal', 'calls_6_mnth', 'logons_6_mnth'],
      dtype='object')

In [11]:
# sorted values
dfs.sort_values(by=['client_id', 'visitor_id', 'visit_id', 'date_time'], ascending=[True, True, True, True])

,client_id,visitor_id,visit_id,process_step,date_time
697779,169,201385055_71273495308,749567106_99161211863_557568,start,2017-04-12 20:19:36
697778,169,201385055_71273495308,749567106_99161211863_557568,step_1,2017-04-12 20:19:45
697777,169,201385055_71273495308,749567106_99161211863_557568,step_2,2017-04-12 20:20:31
697776,169,201385055_71273495308,749567106_99161211863_557568,step_3,2017-04-12 20:22:05
697775,169,201385055_71273495308,749567106_99161211863_557568,confirm,2017-04-12 20:23:09
...,...,...,...,...,...
305392,9999875,738878760_1556639849,931268933_219402947_599432,step_1,2017-06-01 22:40:08
305391,9999875,738878760_1556639849,931268933_219402947_599432,step_1,2017-06-01 22:41:28
305390,9999875,738878760_1556639849,931268933_219402947_599432,step_2,2017-06-01 22:41:47
305389,9999875,738878760_1556639849,931268933_219402947_599432,step_3,2017-06-01 22:44:58
305388,9999875,738878760_1556639849,931268933_219402947_599432,confirm,2017-06-01 22:48:39

In [ ]:
dfs

In [15]:
df_all = pd.concat([dfs, df3, df4], ignore_index=True)
df_all

,client_id,visitor_id,visit_id,process_step,date_time,Variation,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
896618,7993686,NaN,NaN,NaN,NaT,NaN,4.0,56.0,38.5,U,3.0,1411062.68,5.0,5.0
896619,8981690,NaN,NaN,NaN,NaT,NaN,12.0,148.0,31.0,M,2.0,101867.07,6.0,6.0
896620,333913,NaN,NaN,NaN,NaT,NaN,16.0,198.0,61.5,F,2.0,40745.00,3.0,3.0
896621,1573142,NaN,NaN,NaN,NaT,NaN,21.0,255.0,68.0,M,3.0,475114.69,4.0,4.0
896622,5602139,NaN,NaN,NaN,NaT,NaN,21.0,254.0,59.5,F,3.0,157498.73,7.0,7.0

In [ ]:
df_test = df_all[df_all['Variation'] =='Test']
df_test['Variation'].tail()

In [ ]:
df_control = df_all[df_all['Variation'] =='control']
df_control['Variation'].tail()